Merge pull request #20 from hshashank06/speed
Updated README
